// Copyright 2022 Ivan Pimchenko (i.pimchenko@gmail.com)
// SPDX-License-Identifier: GPL-2.0-or-later

#include QMK_KEYBOARD_H

///////////////////////////////////////////////////////////////////////////////////////////////
// Код для дебаггинга
///////////////////////////////////////////////////////////////////////////////////////////////
// Показывает в какой позиции матрицы находится это нажатие.
// Инфа отсюда: https://docs.qmk.fm/#/faq_debug?id=debug-examples
// Конфликтует с макросом (ниже) - либо комментить один из кусков кода, либо как-то миксовать
// (не пробовал).
/* 
 * bool process_record_user(uint16_t keycode, keyrecord_t *record) {
 *   // If console is enabled, it will print the matrix position and status of each key pressed
 * #ifdef CONSOLE_ENABLE
 *     uprintf("KL: kc: %u, col: %u, row: %u, pressed: %u\n", keycode, record->event.key.col, record->event.key.row, record->event.pressed);
 * #endif
 *   return true;
 * };
*/
///////////////////////////////////////////////////////////////////////////////////////////////
// Конец: Код для дебаггинга
///////////////////////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////////////////////////////////
// Мех-м задания макроса.
///////////////////////////////////////////////////////////////////////////////////////////////

// 'MARCO', а не 'MACRO' потому, что с 'MACRO' компиляция аварийно завершается, т.к.
// он уже определён в ~/qmk_firmware/quantum/quantum_keycodes.h

enum custom_keycodes {
    MARCO_1 = SAFE_RANGE,
    MARCO_2,
};

bool process_record_user(uint16_t keycode, keyrecord_t *record) {
    switch (keycode) {
    case MARCO_1:
        if (record->event.pressed) {
            // когда кейкод MARCO_1 нажат
            SEND_STRING("*()_UHflfwbz24");
        } else {
            // когда кейкод MARCO_1 отпущен. Это удалять нельзя, т.к. тогда
	    // по отпусканию клавиши макрос будет выполняться повторно
        }
        break;

    // Это прекрасная вещь: последовательно даются Alt-Ins, затем Ctl-Ins. Так я решил
    // проблему использования одной и той же клавиши для копирования в буфер везде!
    // xterm настроен на копирование по Ctl-Ins (во всех остальных графических прогах это
    // работает по-дефолту), а nvim на копирование по Alt-Ins. И вуаля!
    // Оставил в таком варианте: по нажатию Alt-Ins, по отпусканию Ctl-Ins, но работает и в
    // одну строку (тестил): SEND_STRING(SS_LALT(SS_TAP(X_INSERT)) SS_LCTL(SS_TAP(X_INSERT)));
    // (строку нужно поставить под if, а else оставить пустым (как в MARKO_1 выше).
    case MARCO_2:
        if (record->event.pressed) {
		SEND_STRING(SS_LALT(SS_TAP(X_INSERT)));
        } else {
		SEND_STRING(SS_LCTL(SS_TAP(X_INSERT)));
        }
        break;
    }
    return true;
};

///////////////////////////////////////////////////////////////////////////////////////////////
// Конец: Мех-м задания макроса.
///////////////////////////////////////////////////////////////////////////////////////////////

// Определение слоёв
#define MAIN   0 // Главный слой. Более или менее повторяет стандартную раскладку.
#define NUMPAD 1 // Собственно нампад
#define ARROWS 2 // Слой со стрелками, F1-F12, PgUP, PgDN, Home, End, Ins, Del и др.
#define MOUSE  3 // Слой F13-F20 и мышка.

// Алиас на длинный keycode, который портит мне всю красивую картину
#define BOOTLDR QK_BOOTLOADER

// Собственно раскладки
const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {

// --------------------------------
// Некоторые пояснения по клавишам:
// --------------------------------
//
// _______, (синонимы KC_TRNS или KC_TRANSPARENT) - это пустая клавиша, использующая, цитата из
// docs.qmk.fm, "the next lowest non-transparent key" (дословный перевод - слудующую нижнюю
// непрозрачную клавишу.)
//
// XXXXXXX (синоним KC_NO) - пустая клавиша ничего не делающая
//
// KC_LBRC (left brace (или bracket) - квадратная скобка.
// KC_LCBR (left curly brace (или bracket) - фигурная скобка. Это shifted символ.
// KC_LPRN (left parenthesis) - круглая скобка. Это shifted символ.
// KC_LABK (left angle bracket) - треугольная скобка. Это shifted символ.
// shifted символы не могут использоваться с конструкциями типа LALT_T(KC_LCBR).
//
// Так можно делать "алиасы" клавиш, чтобы облегчить читаемость раскладок на длинных сочетаниях
// define TASK  LCTL(LSFT(KC_ESC))
// define TAB_L LCTL(LSFT(KC_TAB))
//
// В раскладках ниже и в клавишах-переключателях слоёв можно использовать как имена,
// так и номера слоёв.

[MAIN] = LAYOUT_5x7_ip(
//                     ┌──────────────┬─────────┬─────────┬─────────┐                                        ┌─────────┬─────────┬─────────┬─────────────────┐
//                     │ мизинец      │ безым.  │ средн.  │ указ.   │                                        │ указат. │ средний │ безымян.│ мизинец         │
// ┌─────────┬─────────┼──────────────┼─────────┼─────────┼─────────┼─────────┐              ┌───────────────┼─────────┼─────────┼─────────┼─────────────────┼───────────────┬─────────┐
     _______ , KC_1    , KC_2         , KC_3    , KC_4    , KC_5    , KC_6    ,                KC_7          , KC_8    , KC_9    , KC_0    , KC_MINS         , KC_EQL        , KC_LNG3 ,
// ├─────────┼─────────┼──────────────┼─────────┼─────────┼─────────┼─────────┤              ├───────────────┼─────────┼─────────┼─────────┼─────────────────┼───────────────┼─────────┤
     _______ , KC_GRV  , KC_Q         , KC_W    , KC_E    , KC_R    , KC_T    ,                KC_Y          , KC_U    , KC_I    , KC_O    , KC_P            , KC_LBRC       , KC_RBRC ,
// ├─────────┼─────────┼──────────────┼─────────┼─────────┼─────────┼─────────┤              ├───────────────┼─────────┼─────────┼─────────┼─────────────────┼───────────────┼─────────┤
     KC_CAPS , KC_ESC  , LSFT_T(KC_A) , KC_S    , KC_D    , KC_F    , KC_G    ,                KC_H          , KC_J    , KC_K    , KC_L    , RSFT_T(KC_SCLN) , KC_QUOT       , KC_BSLS ,
// ├─────────┼─────────┼┴┴┴┴┴┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼─────────┤              ├───────────────┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┴┴┴┴┴┴┴┴┼───────────────┼─────────┤
     _______ , _______ , LCTL_T(KC_Z) , KC_X    , KC_C    , KC_V    , KC_B    ,                KC_N          , KC_M    , KC_COMM , KC_DOT  , RCTL_T(KC_SLSH) , _______       , _______ ,
// └─────────┴─────────┴──────────────┼─────────┼─────────┼─────────┴─────────┘              └───────────────┴─────────┼─────────┼─────────┼─────────────────┴───────────────┴─────────┘
                                        KC_APP  , TT(1)   ,                                                              KC_LNG1 , KC_LNG2 ,
//                                    └─────────┴─────────┘                                                            └─────────┴─────────┘
//                                              ┌─────────────────┬────────────────┐    ┌─────────────────┬──────────────┐
                                                  LGUI_T(KC_BSPC) , RGUI_T(KC_TAB) ,      RGUI_T(KC_ENT)  , LT(2,KC_SPC) ,
//                                              ├─────────────────┼────────────────┤    ├─────────────────┼──────────────┤
                                                  MARCO_2         , LALT_T(KC_DEL) ,      RALT_T(KC_PAUS) , LSFT(KC_INS) ,
//                                              ├─────────────────┼────────────────┤    ├─────────────────┼──────────────┤
                                                  LCTL(KC_C)      , LCTL(KC_A)     ,      RGUI(KC_W)      , KC_BTN3
//                                              └─────────────────┴────────────────┘    └─────────────────┴──────────────┘
),

[NUMPAD] = LAYOUT_5x7_ip(
//                     ┌──────────────┬─────────┬─────────┬─────────┐                                        ┌─────────┬─────────┬─────────┬─────────────────┐
//                     │ мизинец      │ безым.  │ средн.  │ указ.   │                                        │ указат. │ средний │ безымян.│ мизинец         │
// ┌─────────┬─────────┼──────────────┼─────────┼─────────┼─────────┼─────────┐              ┌───────────────┼─────────┼─────────┼─────────┼─────────────────┼───────────────┬─────────┐
     TO(0)   , _______ , _______      , _______ , _______ , _______ , _______ ,                _______       , KC_NLCK , KC_PSLS , KC_PAST , KC_PMNS         , _______       , _______ ,
// ├─────────┼─────────┼──────────────┼─────────┼─────────┼─────────┼─────────┤              ├───────────────┼─────────┼─────────┼─────────┼─────────────────┼───────────────┼─────────┤
     _______ , _______ , _______      , _______ , _______ , _______ , _______ ,                _______       , KC_P7   , KC_P8   , KC_P9   , KC_PPLS         , _______       , _______ ,
// ├─────────┼─────────┼──────────────┼─────────┼─────────┼─────────┼─────────┤              ├───────────────┼─────────┼─────────┼─────────┼─────────────────┼───────────────┼─────────┤
     _______ , _______ , _______      , _______ , _______ , _______ , _______ ,                _______       , KC_P4   , KC_P5   , KC_P6   , KC_PPLS         , _______       , _______ ,
// ├─────────┼─────────┼┴┴┴┴┴┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼─────────┤              ├───────────────┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┴┴┴┴┴┴┴┴┼───────────────┼─────────┤
     _______ , _______ , _______      , _______ , _______ , _______ , _______ ,                _______       , KC_P1   , KC_P2   , KC_P3   , KC_PENT         , _______       , _______ ,
// └─────────┴─────────┴──────────────┼─────────┼─────────┼─────────┴─────────┘              └───────────────┴─────────┼─────────┼─────────┼─────────────────┴───────────────┴─────────┘
                                        _______ , _______ ,                                                              KC_P0   , KC_PDOT ,
//                                    └─────────┴─────────┘                                                            └─────────┴─────────┘
//                                              ┌─────────────────┬────────────────┐    ┌─────────────────┬──────────────┐
                                                  _______         , _______        ,      _______         , LT(2,KC_P0)  ,
//                                              ├─────────────────┼────────────────┤    ├─────────────────┼──────────────┤
                                                  _______         , _______        ,      _______         , _______      ,
//                                              ├─────────────────┼────────────────┤    ├─────────────────┼──────────────┤
                                                  _______         , _______        ,      _______         , _______
//                                              └─────────────────┴────────────────┘    └─────────────────┴──────────────┘
),

[ARROWS] = LAYOUT_5x7_ip(
//                     ┌──────────────┬─────────┬─────────┬─────────┐                                        ┌─────────┬─────────┬─────────┬─────────────────┐
//                     │ мизинец      │ безым.  │ средн.  │ указ.   │                                        │ указат. │ средний │ безымян.│ мизинец         │
// ┌─────────┬─────────┼──────────────┼─────────┼─────────┼─────────┼─────────┐              ┌───────────────┼─────────┼─────────┼─────────┼─────────────────┼───────────────┬─────────┐
     TO(0)   , KC_F1   , KC_F2        , KC_F3   , KC_F4   , KC_F5   , KC_F6   ,                KC_F7         , KC_F8   , KC_F9   , KC_F10  , KC_F11          , KC_F12        , BOOTLDR ,
// ├─────────┼─────────┼──────────────┼─────────┼─────────┼─────────┼─────────┤              ├───────────────┼─────────┼─────────┼─────────┼─────────────────┼───────────────┼─────────┤
     _______ , _______ , _______      , _______ , _______ , _______ , _______ ,                LCTL(KC_HOME) , KC_HOME , KC_INS  , KC_PGUP , LSFT(KC_PGUP)   , LCTL(KC_PGUP) , _______ ,
// ├─────────┼─────────┼──────────────┼─────────┼─────────┼─────────┼─────────┤              ├───────────────┼─────────┼─────────┼─────────┼─────────────────┼───────────────┼─────────┤
     _______ , _______ , _______      , KC_PSCR , KC_SLCK , KC_PAUS , _______ ,                KC_LEFT       , KC_DOWN , KC_UP   , KC_RGHT , _______         , _______       , _______ ,
// ├─────────┼─────────┼┴┴┴┴┴┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼─────────┤              ├───────────────┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┴┴┴┴┴┴┴┴┼───────────────┼─────────┤
     MARCO_1 , _______ , _______      , _______ , _______ , _______ , _______ ,                LCTL(KC_END)  , KC_END  , KC_DEL  , KC_PGDN , LSFT(KC_PGDN)   , LCTL(KC_PGDN) , _______ ,
// └─────────┴─────────┴──────────────┼─────────┼─────────┼─────────┴─────────┘              └───────────────┴─────────┼─────────┼─────────┼─────────────────┴───────────────┴─────────┘
                                        _______ , _______ ,                                                              KC_LNG4 , KC_LNG5 ,
//                                    └─────────┴─────────┘                                                            └─────────┴─────────┘
//                                              ┌─────────────────┬────────────────┐    ┌─────────────────┬──────────────┐
                                                  _______         , _______        ,      _______         ,  _______     ,
//                                              ├─────────────────┼────────────────┤    ├─────────────────┼──────────────┤
                                                  _______         , _______        ,      _______         ,  _______     ,
//                                              ├─────────────────┼────────────────┤    ├─────────────────┼──────────────┤
                                                  _______         , _______        ,      _______         ,  _______
//                                              └─────────────────┴────────────────┘    └─────────────────┴──────────────┘
),

[MOUSE] = LAYOUT_5x7_ip(
//                     ┌──────────────┬─────────┬─────────┬─────────┐                                        ┌─────────┬─────────┬─────────┬─────────────────┐
//                     │ мизинец      │ безым.  │ средн.  │ указ.   │                                        │ указат. │ средний │ безымян.│ мизинец
// ┌─────────┬─────────┼──────────────┼─────────┼─────────┼─────────┼─────────┐              ┌───────────────┼─────────┼─────────┼─────────┼─────────────────┼───────────────┬─────────┐
     TO(0)   , _______ , _______      , KC_F13  , KC_F14  , KC_F15  , KC_F16  ,                KC_F17        , KC_F18  , KC_F19  , KC_F20  , _______         , _______       , _______ ,
// ├─────────┼─────────┼──────────────┼─────────┼─────────┼─────────┼─────────┤              ├───────────────┼─────────┼─────────┼─────────┼─────────────────┼───────────────┼─────────┤
     _______ , _______ , _______      , _______ , _______ , _______ , _______ ,                _______       , KC_WH_L , KC_WH_U , KC_WH_R , _______         , _______       , _______ ,
// ├─────────┼─────────┼──────────────┼─────────┼─────────┼─────────┼─────────┤              ├───────────────┼─────────┼─────────┼─────────┼─────────────────┼───────────────┼─────────┤
     _______ , _______ , _______      , KC_ACL0 , KC_ACL1 , KC_ACL2 , _______ ,                KC_MS_L       , KC_MS_D , KC_MS_U , KC_MS_R , _______         , _______       , _______ ,
// ├─────────┼─────────┼┴┴┴┴┴┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼─────────┤              ├───────────────┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┼┴┴┴┴┴┴┴┴┴┴┴┴┴┴┴┴┴┼───────────────┼─────────┤
     _______ , _______ , _______      , _______ , _______ , _______ , _______ ,                _______       , _______ , KC_WH_D , _______ , _______         , _______       , _______ ,
// └─────────┴─────────┴──────────────┼─────────┼─────────┼─────────┴─────────┘              └───────────────┴─────────┼─────────┼─────────┼─────────────────┴───────────────┴─────────┘
                                        _______ , _______ ,                                                              _______ , _______ ,
//                                    └─────────┴─────────┘                                                            └─────────┴─────────┘
//                                              ┌─────────────────┬────────────────┐    ┌─────────────────┬──────────────┐
                                                  _______         , _______        ,      KC_BTN2         , KC_BTN1      ,
//                                              ├─────────────────┼────────────────┤    ├─────────────────┼──────────────┤
                                                  _______         , _______        ,      KC_BTN3         ,  _______     ,
//                                              ├─────────────────┼────────────────┤    ├─────────────────┼──────────────┤
                                                  _______         , _______        ,      _______         ,  _______
//                                              └─────────────────┴────────────────┘    └─────────────────┴──────────────┘
)
};
